Revit 2024 API
DockablePane.IsShown Method
 Identify the pane is currently visible or in a tab.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsShown()
Visual Basic
Public Function IsShown As Boolean
Visual C++
public:
bool IsShown()
See Also
DockablePane Class
Autodesk.Revit.UI Namespace